app/controllers/comments_controller.rb

SELECT  "highlights".* FROM "highlights" WHERE "highlights"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "highlight_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "sports fan"], ["body", "Wow!!! Playoff Rondo is real!!!!!!"], ["highlight_id", 3], ["created_at", "2018-04-26 17:05:12.359092"], ["updated_at", "2018-04-26 17:05:12.359092"]]
---
    def create
        @highlight = Highlight.find(params[:highlight_id])
        @comment = @highlight.comments.create(comment_params)