app/controllers/highlights_controller.rb

  def index
    @highlights = Highlight.all
---
SELECT "highlights".* FROM "highlights"

  def create
    @highlight = Highlight.new(highlight_params)

    respond_to do |format|
      if @highlight.save
---
INSERT INTO "highlights" ("clip", "title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def destroy
    @highlight.destroy
---
DELETE FROM "highlights" WHERE "highlights"."id" = ?  [["id", 7]]

    def set_highlight
      @highlight = Highlight.find(params[:id])
---
SELECT  "highlights".* FROM "highlights" WHERE "highlights"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]